In [10]:
import pandas as pd
import numpy as np

In [12]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn']
                   ,'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],'RecentDelays': 
                   [[23, 47], [], [24, 43, 87], [13], [67, 32]],'Airline': 
                   ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [14]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [25]:
df['FlightNumber'][1]= 10055
df['FlightNumber'][3]= 10075
print(df.dtypes)
df['FlightNumber'] = df.FlightNumber.astype(int)
print(df.dtypes)
df

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
Final_Price      int64
dtype: object
From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
Final_Price      int64
dtype: object

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,From_To,FlightNumber,RecentDelays,Airline,Final_Price
0,LoNDon_paris,10045,"[23, 47]",KLM(!),10045
1,MAdrid_miLAN,10055,[],<Air France> (12),10055
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),10065
3,Budapest_PaRis,10075,[13],12. Air France,10075
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",10085

### 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame

In [31]:
new = df["From_To"].str.split("_", n = 1, expand = True) 
new.rename(columns={0:'From',1:'To'}, inplace=True)
new

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn